; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 107491 2 2 2 4 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	image1 - mode
	infrared0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(supports instrument2 image1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
)
(:goal (and
	(have_image Phenomenon4 image1)
	(have_image Planet5 infrared0)
	(have_image Phenomenon6 image1)
	(have_image Star7 image1)
	(have_image Phenomenon8 infrared0)
	(have_image Planet9 infrared0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
3. (turn_to satellite0 star2 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star2)
   goals met: 0 of 6
4. (turn_to satellite1 planet9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet9)
   goals met: 0 of 6
5. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 6
6. (turn_to satellite1 planet5 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet5)
   goals met: 0 of 6
7. (turn_to satellite0 star7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
8. (turn_to satellite1 phenomenon8 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon8)
   goals met: 0 of 6
9. (take_image satellite0 star7 instrument0 image1)
   added: (have_image star7 image1)
   goals met: 1 of 6
10. (turn_to satellite1 planet5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet5)
   goals met: 1 of 6
11. (turn_to satellite0 planet9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet9)
   goals met: 1 of 6
12. (turn_to satellite1 phenomenon8 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon8)
   goals met: 1 of 6
13. (take_image satellite0 planet9 instrument0 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 2 of 6
14. (turn_to satellite1 phenomenon6 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon6)
   goals met: 2 of 6
15. (turn_to satellite0 planet5 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet5)
   goals met: 2 of 6
16. (turn_to satellite1 phenomenon8 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon8)
   goals met: 2 of 6
17. (take_image satellite0 planet5 instrument0 infrared0)
   added: (have_image planet5 infrared0)
   goals met: 3 of 6
18. (turn_to satellite1 phenomenon4 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon4)
   goals met: 3 of 6
19. (turn_to satellite0 phenomenon6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 6
20. (turn_to satellite1 phenomenon8 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 6
21. (take_image satellite0 phenomenon6 instrument0 image1)
   added: (have_image phenomenon6 image1)
   goals met: 4 of 6
22. (turn_to satellite1 star3 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star3)
   goals met: 4 of 6
23. (turn_to satellite0 phenomenon4 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon4)
   goals met: 4 of 6
24. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 4 of 6
25. (take_image satellite0 phenomenon4 instrument0 image1)
   added: (have_image phenomenon4 image1)
   goals met: 5 of 6
26. (turn_to satellite1 phenomenon8 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon8)
   goals met: 5 of 6
27. (take_image satellite1 phenomenon8 instrument2 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 6 of 6
